app/controllers/photos_controller.rb

SELECT * FROM "photos" WHERE ("photos"."id" = 1)
---
  def show
    @photo = Photo.find(params[:id])

INSERT INTO "photos" ("image_height", "updated_at", "image_filename", "image_width", "image_name", "image_author", "created_at") VALUES(NULL, '2009-10-11 00:13:36', '2008_04_01-Okonomiyaki.jpg', NULL, NULL, NULL, '2009-10-11 00:13:36')
---
 def create
  @photo = Photo.new(params[:photo])
  if @photo.save